myPlaneWall2D/planeWall2D/0/wall/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/wall";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    leftLet
    {
        type            zeroGradient;
        value           uniform 300;
    }
    rightLet
    {
        type            zeroGradient;
        value           uniform 300;
    }
    frontAndBack
    {
        type            empty;
    }
    wall_to_bottomAir
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappa           solidThermo;
        kappaName       none;
    }
    wall_to_topAir
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           uniform 300;
        Tnbr            T;
        kappa           solidThermo;
        kappaName       none;
    }
}


// ************************************************************************* //
